AuditLogs
| where ActivityDisplayName == "Add user" or ActivityDisplayName == "Delete user"
| project TimeGenerated, ActivityDisplayName, InitiatedBy, TargetResources, IPAddress
| order by TimeGenerated desc
